Repository: flowerbuddies/transcendence
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi, fr

source: ready
fi: valmis

source: %(player)s won the tournament wowieee!!
fi: %(player)s voitti turnauksen vautsivau!!
fr: %(player)s a gagné le tournoi oh là là!!

source: next match
fi: seuraava matsi
fr: prochain match

source: match in %(seconds)s..
fi: matsi alkaa %(seconds)s..
fr: match dans %(seconds)s..

source: not ready
fi: ei valmis

source: press
fi: paina
fr: appuyer

source: or
fi: tai
fr: ou

source: waiting for players to be ready..
fi: odotetaan että pelaajat ovat valmiita..

source: %(player)s won the match woo!
fi: %(player)s voitti matsin vautsi!
fr: %(player)s a gagné le match waouh!

source: eliminated
fi: eliminoitu
fr: éliminé

source: balls missed %(score)s/3
fi: läpi menneet pallot %(score)s/3
fr: balles perdues %(score)s/3

# game.info.waiting
source: waiting for players..
fi: odotetaan pelaajia..
fr: en attente de joueurs..

# game.info.press
source: press
fi: paina
fr: appuyer

# game.info.to_exit
source: to exit
fi: poistuaksesi
fr: partir

# join.lobbyName.title
source: Lobby name
fi: Palvelimen nimi
fr: Nom du lobby

# join.type.title
source: Game mode
fi: Pelityyppi
fr: Mode de jeu

# join.players.title
source: Players
fi: Pelaajat
fr: Joueur.ses

# join.playerName.title
source: Player name
fi: Pelaajan nimi
fr: Nom du/de la joueur.se

# join.action.title
source: Action
fi: Toiminto

# language.go
source: Go
fi: Aseta

# join.type.types.tournament1v1
source: Tournament 1v1
fi: Turnaus 1v1
fr: Tournoi 1vs1

# join.type.types.tournament1v1v1v1
source: Tournament 1v1v1v1
fi: Turnaus 1v1v1v1
fr: Tournoi 1vs1vs1vs1

# join.type.types.game1v1
source: Game 1v1
fi: Peli 1v1
fr: Partie 1vs1

# join.type.types.game1vAI
source: Game 1vAI
fi: Peli 1vAI
fr: Partie 1vsIA

# join.type.types.game1v1v1v1
source: Game 1v1v1v1
fi: Peli 1v1v1v1
fr: Partie 1vs1vs1vs1

# join.type.types.game1v1vAIvAI
source: Game 1v1vAIvAI
fi: Peli 1v1vAIvAI
fr: Partie 1vs1vsIAvsIA

# join.players.connected_players
source: Connected players
fi: Liittyneet pelaajat
fr: Joueur.ses connecté.es

# join.players.player_slots
source: Player slots
fi: Pelaajien määrä
fr: Nombre de joueur.ses

# join.action.full
source: Full
fi: Täynnä
fr: Complet

# join.action.join
source: Join
fi: Liity
fr: Rejoindre

# join.action.create
source: Create
fi: Luo
fr: Créer

# views.fields.empty
source: Not all fields specified
fi: Kaikkia kenttiä ei ole täytetty
fr: Tous les champs n'ont pas été spécifiés

# input.group_name.incorrect_characters
source: Lobby name must be under 100 characters and contain only ASCII alphanumerics, hyphens, underscores, or periods
fi: Palvelimen nimen pitää olla pituudeltaan alle 100 merkkiä ja sisältää ainoastaan ASCII kirjaimia, numeroita, väliviivoja, pisteitä tai alaviivoja
fr: Le nom du lobby ne peut dépasser les 100 caractères, ils doivent être des caractères ASCII, des tirets (du 6 ou 8), ou des des points

# input.player_name.length
source: Player name must be between 1 and 12 characters
fi: Pelaajan nimen pituuden pitää olla 1 ja 12 merkin välillä
fr: Le nom du/de la joueur.se doit être entre 1 et 12 caractères

# input.player_name.whitespace
source: Players name can't be purely whitespace
fi: Pelaajan nimi ei saa sisältää yksistään tyhjätilamerkkejä
fr: Le nom du/de la joueur.se ne peut pas pas contenir d'espaces

# input.player_name.same
source: Players 1 and 2 can't have the same name
fi: Pelaajilla 1 ja 2 ei saa olla samaa nimeä
fr: Les noms des joueur.ses ne peuvent pas être les mêmes

# input.game1v1.count
source: Player count must be 2 for this game mode
fi: Pelaajien määrän pitää olla 2 tässä pelityypissä
fr: Le nombre de joueur.ses doit être de 2 pour ce mode de jeu.

# input.game1v1v1v1.count
source: Player count must be 4 for this game mode
fi: Pelaajien määrän pitää olla 4 tässä pelityypissä
fr: Le nombre de joueur.ses doit être de 4 pour ce mode de jeu.

# input.tournament1v1.count
source: Player count must be a power of 2 for this game mode
fi: Pelaajien määrän pitää olla 2. potenssi tässä pelityypissä
fr: Le nombre de joueur.ses doit être une puissance de 2 pour ce mode de jeu.

# input.tournament1v1v1v1.count
source: Player count must be a power of 4 for this game mode
fi: Pelaajien määrän pitää olla 4. potenssi tässä pelityypissä
fr: Le nombre de joueur.ses doit être une puissance de 4 pour ce mode de jeu.

# input.game_mode.invalid
source: Invalid game mode
fi: Virheellinen pelityyppi
fr: Mode de jeu invalide

# input.lobby.nonexistent
source: Lobby no longer exists
fi: Palvelinta ei ole enää olemassa
fr: Le lobby n'existe plus

# input.lobby.full
source: The lobby is full
fi: Palvelin on täynnä
fr: Le lobby est plein

# input.lobby.one_spot
source: Only one spot left
fi: Vain yksi paikka jäljellä
fr: Seulement une place est disponible

# input.player_name.one_taken
source: Player 1 name already taken
fi: Pelaajan 1 nimi on jo otettu
fr: Le nom du/de la joueur.se 1 est déjà prit

# input.player_name.two_taken
source: Player 2 name already taken
fi: Pelaajan 2 nimi on jo otettu
fr: Le nom du/de la joueur.se 2 est déjà prit
